Repository: PaytmLabs/nerve
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: es

source: Asset
es: Sistema

source: Low
es: Bajo

source: Medium
es: Medio

source: High
es: Alto

source: Critical
es: Crítico

source: Potential
es: Potencial

source: Undefined
es: Indefinido

source: Target
es: Objetivo

source: Port
es: Puerto

source: Severity
es: Severidad

source: Actions
es: Acciones

source: View
es: Ver

source: Hi!
es: Hola!

source: About
es: Intro

source: Welcome to
es: Bienvenido a

source: the
es: correspondiente a

source: Its purpose is to scan and identify short and long lived security flaws using one-time or continous scan modes on a given network or host.
es: Su proposito es escanear e identificar variadas fallas de seguridad utilizando distintos modos de escaneos en una red o host.

source: This can be achieved either programmatically via the
es: Esto se puede lograr mediante la

source: or using the Graphical User Interface
es: o utilizando la Interfaz Gráfica para usuarios.

source: How does it work?
es: ¿Como funciona?

source: You configure your network or domain list
es: Configura la red o lista de dominios

source: You define which attacks to run (Brute Force, etc.)
es: Decide que ataques correr(Fuerza Bruta, etc.)

source: You run the assessment...
es: Corre la evaluación

source: You wait for the results!
es: ¡Espera por los resultados!

source: Could not display alert.
es: No se pudo desplegar la alerta.

source: Could not resolve alert.
es: No se pudo resolver la alerta.

source: Resolved alert successfully.
es: Alerta resuelta exitosamente.

source: file is missing
es: archivo faltante

source: There is no data in the system for report generation
es: No hay datos en el sistema para la generación de reportes

source: Last scan has not finished yet.
es: Último escaneo aún no ha terminado.

source: Your IP has been blocked.
es: Su IP ha sido bloqueada.

source: Incorrect username or password. After 5 attempts, you will get blocked.
es: Usuario o contraseña incorrectos. Después de 5 intentos fallidos será bloqueado.

source: Logged out successfully
es: Cierre de sesión exitoso

source: Assessment started.
es: Comienzo de Evaluación.

source: Malformed Scan Data
es: Data de Escaneo Malformada

source: Saved Slack Setting
es: Ajustes de Slack Guardados

source: Slack hook must be a URL
es: Hook de Slack debe ser una URL

source: Error Occurred
es: Ocurrió un Error

source: Deleted Email Settings
es: Ajustes de Correo Eliminados

source: Deleted Slack Settings
es: Ajustes de Slack Eliminados

source: Rolled back successfully
es: Roll back exitoso

source: Malformed data, must be JSON
es: Data Malformada, debe ser JSON

source: action type is missing
es: tipo de acción faltante

source: unsupported action
es: acción no soportada

source: flushed scan state
es: Estado de escaneo reseteado
