Repository: PaytmLabs/nerve
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: es

source: Think of this more of a sanity check, than a comprehensive brute force attempt. Our goal is not to try millions of passwords, this will not be efficient.
es: Estos ataques son una especie de chequeo de sanidad, más que un ataque de fuerza bruta completo e integral. La meta no es probar millones de contraseñas, puesto que esto no es eficiente.

source: When providing the list, make sure it is separated by a new line, e.g.
es: Al proveer una lista, asegurarse que las entradas estén separadaos por un nueva línea, p. ej.

source: Schedule is when and how often you want to run an assessment. There are 3 options:
es: Agendado permite determinar cuando y donde se quiere efectuar una evaluación. Existen 3 opciones:

source: and
es: y

source: Continuously
es: Continuo

source: means a scan will run 1 time inmediately, and then it's over.
es: significa que el escaneo se efectuará una vez inmediatamente, y después terminará.

source: means you can schedule the time the scan will run.
es: significa que se puede agendar la fecha en la que se efectuará el escaneo.

source: A calendar input will appear if using this mode. You can set the execution date through the calendar or directly into the input field.
es: Un calendario se desplegará al utilizar este modo. La fecha de ejecución del escaneo se puede seleccionar en el calendario deplegado o inrgesar directamente en el campo de fecha.

source: means, a scan will run, and then another one will follow, until the end of humanity.
es: significa que un escaneo se efectuará y luego otro lo seguirá, hasta el fin de la humanidad.

source: When running in Continuous Mode, a "Status" indicator will appear on the sidebar (Menu bar) indicating the system will run forever.
es: Al efectuar un escaneo en el modo Continuo, un indicador "Estado" aparecerá en la barra lateral (barra del Menú) indicando que el sistema correrá por siempre.

source: If you want to stop, just click on the new button that will appear on the side bar called
es: Para detener la ejecución, simplemente hacer click en el nuevo botón que aparecerá en la barra lateral llamado

source: Reset System
es: Resetear Sistema

source: To achieve true Continuous Security, we recommend to run it in Continuous mode.
es: Para alcanzar verdadera Seguridad Continua, se recomiendo utilizar la herramienta en el modo Continuo.

source: You can configure NERVE to send you post events.
es: Se puede configurar NERVE para realizar acciones posteriores a un evento.

source: A web hook is basically a post-process event that happens after some condition is met (such as, after a scan is completed.)
es: Un webhook es un evento post-procesamiento que ocurre un tiempo después de que se cumple una condición (como por ejemplo, después de terminar un escaneo).

source: NERVE can send you the Assessment data as soon as a scan completes, to an endpoint of your choice. Your endpoint must be able to be accessed by NERVE, and receive JSON data.
es: NERVE puede enviar la información de la evaluación tan rápido como termina el escaneo a un endpoint determinado. El endpoint debe permitir el acceso de NERVE y recibir datos JSON.

source: The data NERVE is going to send, may look like the following:
es: Un ejemplo de los datos que envía NERVE se muestran a continuación:

source: A webhook endpoint may look like this:
es: Un endpoint de un webhook puede lucir así:

source: or with a specified port
es: o con un puerto específico

source: Reports
es: Reportes

source: NERVE supports 3 types of reports. These reports are only available via the Web Interface.
es: NERVE soporta 3 tipos de reportes. Estos reportes se encuentran disponibles vía la Interfaz Web de la herramienta.

source: All the reports are saved on disk at
es: Todos los reportes son guardados en disco en

source: if you need to go back in time and fetch historical reports.
es: por si se quieren revisar los reportes históricos.

source: If you want to obtain the results of your assessment via the API, use the endpoint
es: En el caso de querer obtener los resultados de la evaluación vía la API, utilizar el endpoint

source: Notifications
es: Notificaciones

source: NERVE supports delivering notifications via 2 methods:
es: NERVE entrega notificaciones por 2 métodos:

source: or
es: o

source: You can find these settings under the top right menu (Username) -> Settings
es: Estas opciones se encuentran en el menú superior derecho (Usuario) -> Configuraciones

source: For email, you can use Amazon SES or a different provider. You will receive an attachment with the findings in a JSON format, once a scan is completed.
es: Para email, se puede utilizar Amazon SES o un proveedor diferente. Se recibirá un archivo adjunto con los resultados en formato JSON una vez terminado el escaneo.

source: For slack, use an
es: Para slack, utilizar un

source: and paste the URL Slack gives you at the end of the process. You will receive a slack notification with the results once a scan is completed.
es: y pegar la URL que Slack entrega al final del proceso. De este modo, será posible recibir notificaciones de slack con los resultados una vez finalizado un escaneo.

source: Security
es: Seguridad

source: There are a few security mechanisms implemented into NERVE you need to be aware of.
es: Existen algunos mecanismos de seguridad implementados en NERVE que son importantes de considerar.

source: - A response header which controls where resource scan be loaded from.
es: - Un encabezado de respuesta que controla desde donde serán cargados los recursos del escaneo.

source: Other Security Policies
es: Otras Políticas de Seguridad

source: - These Response headers are enabled: Content-Type Options, X-XSS-Protection, X-Frame-Options, Referer-Policy
es: - Estos encabezados de respuestas se encuentra habilitados: Content-Type Options, X-XSS-Protection, X-Frame-Options, Referer-Policy

source: Brute Force Protection
es: Protección de Fuerza Bruta

source: - A user will get locked if more than 5 incorrect login attempts are made.
es: - El usuario será bloquea al fallar 5 veces el inicio de sesión.

source: Cookie Protection
es: Protección de Cookies

source: - Cookie security flags are used, such as SameSite, HttpOnly, etc.
es: - Flags de seguridad para Cookies son utilizadas, como SameSite, HttpOnly, entre otras.

source: If you identify a security vulnerability, please submit a bug to us on GitHub.
es: En caso de identificar una vulnerabilidad, por favor notificar el bug en GitHub.

source: If you want to upgrade your platform, the fastest way is to simply git clone and overwrite all the files while keeping key files such as configurations.
es: En el caso de querer upgradear la plataforma, la forma más simple es simplemente efectuar git clone y sobreescribir todos los archivos. Preservando archivos clave como configuraciones.

source: Make a copy of
es: Hacer una copia de

source: if you wish to save your configurations
es: en el caso de desear guardar las configuraciones

source: Remove
es: Remover

source: and git clone it again from:
es: y ejecuar git clone nuevamente desde:

source: Move
es: Mover

source: file back into
es: el archivo devuelta a

source: Restart the service using
es: Resetear el servicio utilizando

source: You could set up a cron task auto-upgrade NERVE, there's an API endpoint to check whether you have the latest version or not that you could use for this purpose:
es: Es posible configurar un tarea de cron para actualizar o mejorar automáticamente la herramienta, existe un API endpoint que permite chequear la última versión disponible que se puede utilizar para este proposito:

source: Miscellaneous
es: Misceláneo

source: Web Interface Logo
es: Interfaz Web Logo

source: If you want to brand NERVE with your own Logo, simply replace
es: En el caso de querer cambiar la marca de la herramienta, simplemente reemplazar

source: with your own picture.
es: con su propia imágen.

source: 400px x 100px is the recommended size.
es: 400px x 100px es el tamaño recomendado.

source: 1. Authentication
es: 1. Autenticación

source: Welcome to the API section of NERVE.
es: Bienvenido a la sección APIs de NERVE.

source: NERVE's API is simple, you can post a scan, get the scan result and status, and reset the system.
es: La API de NERVE es simple, se puede postear un escaneo, obtener los resultados, obtener el status y resetar el sistema.

source: For posting a scan, NERVE uses the same settings that exist in the Web Interface, should you need to understand more about what a particular setting does, just refer to the
es: Para postear un escaneo, NERVE utiliza las mismas configuraciones existentes en la Intefaz Web. En caso de necesitar entender lo que hace una configuración en particular, refererse a la

source: Graphical User Interface section
es: sección Interfaz Gŕafica de Usuarios

source: of the document.
es: del documento.

source: Authentication
es: Autenticación

source: API Authentication is done using Basic Authentication.
es: La autenticación a través de la API es realizada utilizando Autenticación Básica.

source: Basic authentication is a simple authentication scheme built into the HTTP protocol. The client sends HTTP requests with the Authorization header that contains the word Basic word followed by a space and a base64-encoded string username:password
es: La Autenticación Básica es un esquema simple de autenticación en base al protocolo HTTP. El cliente envía una solicitud HTTP con el encabezado de Autorización, el cual contiene la palabra "Basic" seguido por un espacio y un string usuario:contraseña codificado en base64.

source: With each API call, you need to pass the credentials. Here is an example with Python and the requests library:
es: Con cada llamada a la API es necesario pasar credenciales. A continuación se muestra un ejemplo con Python y la librería de solicitudes:

source: API Table
es: Tabla de la API

source: Method
es: Método

source: Information
es: Información

source: False
es: Falso

source: Returns Server Health Status
es: Retorna el Estado de Salud del Servidor

source: True
es: Verdadero

source: Submits an Assessment
es: Sube una Evaluación

source: Returns Assessment Status & Results
es: Retorna el Estado de la Evaluación y los Resultados

source: Resets the Server. Roll Back.
es: Resetea el Servidor. Roll Back.

source: Returns the current exclusion list
es: Retorna el la lista de exclusiones actual

source: Submits an exclusion list
es: Sube la lista de exclusiones

source: Checks if updates are available
es: Chequea si existen actualizaciones disponibles

source: Health is an endpoint to do basic sanity-checks for monitoring systems, etc.
es: Salud es un endpoint que permite efectuar chequeos de sanidad básicos para monitorear sistemas, etc.

source: This endpoint is where you can submit new scans with a configuration file similar to the Web Interface.
es: Este endpoint es donde se suben nuevos escaneos en base a un archivo de configuración, similar a la Interfaz Web.

source: The configuration file must be provided as-is without removing any entries.
es: Este archivo de configuración debe mantener el mismo formato, sin remover ninguna entrada.

source: This endpoint is where you can view the state of a running scan.
es: Este endpoint permite visualizar el estado de ejecución de un escaneo.

source: Note that you do not need to wait for a scan to complete, results will be shown as soon as new data is created.
es: Notar que no es necesario esperar que el escaneo se complete, los resultados serán desplegados tan pronto como nuevos datos sean creados.

source: This endpoint allows you to reset the system / stop a currently running assessment (such as continuous)
es: Este endpoint permite reiniciar el sistema / para la evaluación actual (por ejemplo, en modo Continuo)

source: This endpoint is where you get the current exclusion list.
es: Este endpoint permite obtener la lista de exclusiones actual

source: You may want to use the Exclusion functionality to prevent certain traffic from running against certain assets, or to prevent certain alerts from getting created.
es: En algunas casos puede ser de utilidad la opción de Exclusión para prevenir la ejecución de cierto tráfico en ciertos activos informáticos. O para prevenir que surjan ciertas alertas.

source: This endpoint is where you can submit an exclusion list. The JSON in your POST must have a valid format as shown below.
es: Este endpoint es donde se puede subir la lista de exclusiones. El archivo JSON en POST debe tener el formato válido mostrado más abajo.

source: Rule IDs can be retrieved from
es: Los IDs de las reglas pueden ser extraídos de los archivos

source: files
es: archivos

source: This endpoint allows you to check if you have the latest NERVE version.
es: Este endpoint permite chequear si se encuentra instalada la última versión de NERVE.

source: Add new scripts
es: Agregar nuevos scripts

source: Additional custom scripts can be added to NERVE scans by users. The tool by default accepts scripts in a specific Python format, some scripts that follow this format are stored in folder "rules", they can be used as reference when developing custom scripts. To add this type of scripts, just store them in any subfolder of "rules".
es: Scripts personalizados pueden ser agregados a la herramienta porlos usuarios. NERVE por defecto acepta scripts en un formato específico de Python, en la carpeta "rules" se encuentran algunos scripts en este formato, los cuales pueden ser utilizados como referencia la hora de desarrollar nuevos scripts. Para agregar este tipo de scripts a NERVE, simplemente hay que almacenar los archivos en una de las subcarpetas de "rules".

source: NERVE also allows the execution of scripts in
es: NERVE también permite la ejecución de scripts en el formato

source: format with some restrictions. This restrictions can be lifted with some additional work. The following steps describe the actions needed to add new NSE scripts to the software with all their features. The newly added scripts can then be used in future scans.
es: con algunas restricciones. Estas restricciones pueden ser levantados con un poco de trabajo adicional. A continuación se detallan los pasos necesarios para poder agregar nuevos scripts a la herramienta en el formato NSE con todas sus funcionalidades.

source: Steps
es: Pasos

source: Add the new script to folder
es: Agregar el nuevo script a la carpeta

source: [Optional]
es: [Opcional]

source: Add parameters accepted by script in file 'config.py'. This value will be used in future scans. Everytime the value modified, the application must be restarted in order to apply the changes.
es: Agregar parámetros aceptados por el script en el archivo 'config.py'. Este valor será utilizado en escaneos futuros. Cada vez que se modifique el valor la aplicación debe ser reiniciada para aplicar los cambios.

source: The parameter is given to the script through a variable defined in config.py file, the format used for the variable is the following:
es: Este parámetro se le entrega al script mediante una variable definida en el archivo 'config.py', el formato utilizado para definir la variable es el siguiente:

source: NAME_OF_SCRIPT_NAME_OF_PARAMETER = value
es: NOMBRE_DEL_SCRIPT_NOMBRE_DEL_PARAMETRO = valor

source: Where:
es: Donde:

source: 'NAME_OF_SCRIPT' is the name of the file of the script.
es: 'NOMBRE_DEL_SCRIPT' es el nombre del archivo del script.

source: 'NAME_OF_PARAMETER' is the name of the parameter accepted by the script.
es: 'NOMBRE_DEL_PARAMETRO' es el nombre del parámetro aceptado por el script.

source: 'value' is the value that the parameter will adopt when running the script.
es: 'valor' es el valor del parámetro que se utiliza al correr el script.

source: Other things to consider:
es: Otras cosas a considerar:

source: The variable name is defined by the union of 'NAME_OF_SCRIPT' and 'NAME_OF_PARAMETER' using the character '_'.
es: El nombre de la variable queda definido por la unión del 'NOMBRE_DEL_SCRIPT' con el 'NOMBRE_DEL_PARAMETRO' utilizando el carácter '_'.

source: The variable can be defined in upper or lower case.
es: La variable puede ser definida con los caracteres en mayúscula o minúscula.

source: Erase file type from 'NAME_OF_SCRIPT'. For example, if file is called 'ftp_exploit.nse' it should be used as 'FTP_EXPLOIT'.
es: Es necesrio borrar el tipo del archivo del 'NOMBRE_DEL_SCRIPT'. Por ejemplo, si es archivo se llama 'ftp_exploit.nse' debería dejarse como 'FTP_EXPLOIT'.

source: If file name includes character '-' it needs to be replaced by character '_'. For instance, if file is called 'ftp-exploit' then the result would be 'FTP_EXPLOIT'.
es: Si el nombre incluye el carácter '-' debe ser reemplazado por el carácter '_'. Por ejemplo, si el archivo se llama 'ftp-exploit' entonces el resultado sería 'FTP_EXPLOIT'.

source: Lastly, if name of parameter includes character '.' replace by character '_'. This way parameter 'brute.credfile' needs to be transformed to 'BRUTE_CREDFILE' to be used.
es: Por último, si el nombre del paŕametro incluye el carácter '.' es necesario reemplazarlo por '_'. De este modo, el parámetro 'brute.credfile' queda como 'BRUTE_CREDFILE' al transformar.

source: One final example encompassing all these rules is mentioned here: For
es: A continuación se muestra un ejemplo abarcando todas las reglas mencionadas con anterioridad: Para

source: file 'ftp-steal.nse'
es: el archivo 'ftp-steal.nse'

source: with
es: con

source: parameter 'brute.credfile'
es: parámetro 'brute.credfile'

source: value './credfile'
es: valor './credfile'

source: The corresponding variable would be
es: La variable resultante quedo como

source: Add support to different types of outputs provided by script. This allows the tool to correctly determine when a vunerability is found by the script.
es: Agregar soporte a diferentes tipos de outputs provistos por el script. Esto permite a la herramienta determinar correctamente cuando el script encuentra una vulnerabilidad.

source: This feature can be added by modifying the function 'verify_output in file 'core/nse_script.py'. Programming knowledge is required in order to parse the different outputs.
es: Esta funcionalidad puede lograrse modificando la función 'verify_output' en el archivo 'core/nse_scripts.py'. Cabe mencionar que es requerido conocimiento de programador para parsear los diferentes tipos de outputs.

source: Add metadata to scripts. The supported fields are the following:
es: Agregar metada de los scripts. Los campos soportados por NERVE son los siguientes:

source: Description:
es: Descripción:

source: Description of the attack or analysis done by the script.
es: Corresponde a la descripción del ataque o análisis efectuado por el script.

source: Severity:
es: Severidad:

source: Indicates the severity level of the script. In other words, how critical is the vulnerability associated. It ranges from 0 to 6, where:
es: Indica el nivel de severidad del script. En otras palabras, que tan crítica es la vulnerabilidad asociado. Va desde 0 - 6, donde:

source: Unknown
es: Indeterminado

source: Confirm:
es: Confirmación:

source: Detail of the vulnerability found.
es: Detalle de la vulnerabilidad encontrada.

source: Mitigation:
es: Mitigación:

source: Steps needed to mitigate the vulnerability.
es: Pasos necesarios para mitigar la vulnerabilidad.

source: Intensity:
es: Intesidad:

source: Same as 'aggressiveness level' used by NERVE. Determines the impact of the running script on its targets. Value ranges from 0 - 3. Where:
es: Equivalente al 'nivel de agresividad' utilizado por NERVE. Corresponde al impacto de los scripts en los objetivos de los escaneos. Su valor se encuentra en el rango 0 - 3. Donde:

source: Mildly Aggreessive
es: Medianamente Agresivo

source: Extremely Agressive
es: Extremedamente Agresivo

source: A NSE script containing all metadata fields is available in
es: Un script NSE con todos los campos de metadata se encuentra disponible en

source: Username
es: Usuario

source: Password
es: Contraseña

source: Login
es: Inicio de Sesión

source: New Version is Available
es: Nueva Versión Disponible

source: English
es: Inglés

source: Spanish
es: Español

source: Report a Bug
es: Reportar Problema

source: Settings
es: Ajustes

source: Logout
es: Cierre de Sesión

source: Quick Start
es: Inicio Rápido

source: This is the
es: Este es la forma

source: quickest
es: más rápida

source: way to get started.
es: de empezar.

source: The quick start method uses predefined settings as we see fit. You can find the scan definitions
es: El método de inicio rápido use ajustes predeterminados establecidos por nosotros. Las definiciones de los escaneos se pueden encontrar

source: here
es: aquí

source: All you need to do is define the network and click
es: Todo lo que debes hacer es definir la red y clickear

source: GO!
es: Partir!

source: CIDR Network
es: CIRD Red

source: What is CIDR?
es: Que es CIDR?

source: Network
es: Redes

source: Overview
es: Resumen

source: TIMESTAMP
es: FECHA

source: NAME
es: NOMBRE

source: ENGINEER
es: INGENIERO

source: SOURCE IP
es: DIRECCIÓN IP

source: CRITICAL
es: CRÍTICO

source: HIGH
es: ALTO

source: MEDIUM
es: MEDIO

source: LOW
es: BAJO

source: POTENTIAL
es: POTENCIAL

source: UNDEFINED
es: INDEFINIDO

source: Vulnerabilities
es: Vulnerabilidades

source: TITLE
es: TÍTULO

source: FINDINGS
es: RESULTADOS

source: ADDRESS
es: DIRECCIONES

source: PORT
es: PUERTOS

source: DETAILS
es: DETALLES

source: RULE_ID
es: ID_REGLAS

source: MITIGATION
es: MITIGACIÓN

source: Below you can download your latest completed assessment report in various formats.
es: Abajo se puede descargar la última evaluación completada en varios formatos.

source: Detailed Report (HTML)
es: Reporte Detallado (HTML)

source: Raw Report (TXT)
es: Reporte Bruto (TXT)

source: Raw Report (CSV)
es: Reporte Bruto (CSV)

source: Raw Report (XML)
es: Reporte Bruto (XML)

source: Settings
es: Ajustes

source: Email
es: Correo

source: SMTP Host
es: Host SMTP

source: Configured
es: Configurado

source: SMTP Port
es: Puerto SMTP

source: SMTP Username
es: Usuario SMTP

source: SMTP Password
es: Contraseña SMTP

source: From Address
es: Desde Dirección

source: Emails will come from this address
es: Correo llegarán desde esta dirección

source: Recipient Address
es: Dirección Destinatario

source: Emails will be sent to this address
es: Correos serán enviados desde esta dirección

source: -- select an option --
es: -- seleccione una opción --

source: Currently using
es: Actualmente utilizado

source: Reset
es: Resetear

source: Test
es: Probar

source: Save
es: Guardar

source: SMTP Host and SMTP Port must be set.
es: Host SMTP y Puerto SMTP debe ser completados.

source: SMTP Credentials must be set.
es: Credenciales SMTP debe ser completadas.

source: Sender and Recipient must be set.
es: Remitente y Destinatario deben ser completados.

source: SSL Settings must be STARTTLS or SSL.
es: Ajustes SSL deben ser STARTTLS o SSL.

source: Slack hook must not be empty.
es: Hook de Slack no debe estar vacío.

source: Quick Start
es: Inicio Rápido

source: Dashboard
es: Tablero

source: Assets
es: Sistemas

source: Assessment
es: Evaluación

source: Network Topology
es: Topología de la Red

source: Vulnerabilities
es: Vulnerabilidades

source: Reports
es: Reportes

source: Console
es: Consola

source: Documentation
es: Documentación

source: Usage
es: Uso

source: Developer API
es: API Desarrolladores

source: Add new scripts guide
es: Guía agregar nuevos scripts

source: Reset System
es: Resetear Sistema

source: Continuous Scan Mode
es: Modo de Escaneo Continuo

source: Star us on GitHub
es: Suma una estrella en GitHub

source: Network Topology
es: Topología de la Red

source: LEGEND
es: LEYENDA

source: Self
es: NERVE
