Repository: PaytmLabs/nerve
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: es

source: Default
es: Predeterminado

source: My Default Scan
es: Mi Escaneo Predeterminado

source: Ready
es: Listo

source: Scanning... [QUEUE:%(prog)s]
es: Escaneando... [COLA:%(prog)s]

source: Busy...
es: Ocupado...

source: Ready, next scan scheduled for %(date)s
es: Listo, próximo escaneo agendado para %(date)s

source: Error, missing settings
es: Error, ajustes faltantes

source: SMTP address or SMTP port are empty
es: Dirección SMTP o puerto SMTP se encuentran vacíos

source: SMTP Port must be a number
es: Puerto SMTP debe ser un número

source: FROM or TO Address are empty
es: Dirección de salida o destinario se encuetran vacíos

source: FROM or TO addresses are not valid emails
es: Dirección de salida o destinatario no son correos válidos

source: Error in security settings (must be starttls or ssl).
es: Error en ajuste de seguridad (debe ser starttls o ssl).

source: Error, action is not supported
es: Error, acción no se soportada

source: Test by NERVE
es: Prueba de NERVE

source: This is a test.
es: Esta es una prueba

source: Assessment Complete
es: Evaluación Completada

source: OK, Saved.
es: OK, Guardado.

source: Message was sent successfully
es: Mensaje enviado exitosamente

source: Message could not be sent %(err)s
es: Mensaje no pudo ser enviado %(err)s

source: Option [ASSESSMENT_NAME] must be a String
es: Opción [NOMBRE_DE_EVALUACIÓN] deber ser un String

source: Option [NETWORKS] must be an Array
es: Opción [REDES] debe ser un Arreglo

source: Option [EXCLUDED_NETWORKS] must be an Array
es: Opción [REDES_EXCLUIDAS] debe ser un Arreglo

source: Option [DOMAINS] must be an Array
es: Opción [DOMINIOS] debe ser un Arreglo

source: Option [AGGRESSIVENESS_LEVEL] must be an Integer
es: Opción [NIVEL_DE_AGRESIVIDAD] debe ser un Entero

source: Option [ALLOW_DENIAL_OF_SERVICE] must be a Boolean
es: Opción [PERMITIR_DENEGACIÓN_DE_SERVICIO] debe ser un Booleano

source: Option [ALLOW_INTERNET_OUTBOUND] must be a Boolean
es: Opción [PERMITIR_CONEXIONES_SALIENTES_DE_INTERNET] debe ser un Booleano

source: Option [ALLOW_BRUTE_FORCE] must be a Boolean
es: Opción [PERMITIR_FUERZA_BRUTA] debe ser un Booleano

source: Option [DICTIONARY_USERNAMES] must be an Array
es: Opción [USUARIOS_DICCIONARIO] debe ser un Arreglo

source: Option [DICTIONARY_PASSWORDS] must be an Array
es: Opción [CONTRASEÑAS_DICCIONARIO] debe ser un Arreglo

source: Option [NET_INTERFACE] must be null or a String
es: Opción [INTERFAZ_DE_RED] debe ser nulo o un String

source: Option [MAX_PORTS] must be an Integer
es: Opción [MÁXIMA_CANTIDAD_DE_PUERTOS] debe ser un Entero

source: Option [MAX_PORTS] must be an Array
es: Opción [MÁXIMA_CANTIDAD_DE_PUERTOS] debe ser un Arreglo

source: Option [CUSTOM_PORTS] must be an Array
es: Opción [PUERTOS_PERSONALIZADOS] debe ser un Arreglo

source: Option [PARALLEL_SCAN] must be an Integer
es: Opción [ESCANEO_EN_PARALELO] debe ser un Entero

source: Option [PARALLEL_ATTACK] must be an Integer
es: Opción [ATAQUE_EN_PARALELO] debe ser un Entero

source: Option [WEB_HOOK] must be null or a String
es: Opción [WEB_HOOK] debe ser nulo o un String

source: Option [FREQUENCY] must be a String
es: Opción [FRECUENCIA] debe ser un String

source: Option [SCHEDULE_DATE] must be a String
es: Opción [FECHA_DE_AGENDADO] debe ser un String

source: Option [ASSESSMENT_NAME] must not exceed 30 characters and must not have special characters.
es: Opción [NOMBRE_DE_LA_EVALUACIÓN] no debe exceder los 30 caracteres y no debe contener caracteres especiales.

source: Option [ASSESSMENT_DESCRIPTION] must not exceed 200 characters and must not have special characters.
es: Opción [DESCRIPCIÓN_DE_LA_EVALUACIÓN] no debe exceder los 200 caracteres y no debe contener caracteres especiales.

source: Option [ENGINEER] must not exceed 20 characters and must not have special characters.
es: Opción [INGENIERO] no debe exceder los 20 caracteres y no debe contener caracteres especiales.

source: Option [WEB_HOOK] must be a valid URL.
es: Opción [WEB_HOOK] debe ser una URL válida.

source: Option [SCHEDULE] must be "once" or "continuous" or "schedule"
es: Opción [AGENDADO] debe ser "una vez" or "continuamente" or "agendar"

source: Option [SCHEDULE_DATE] must not be empty if scheduling a scan
es: Opción [FECHA_DE_AGENDADO] no debe estar vacía si se agenda un escaneo

source: Option [SCHEDULE_DATE] must not be prior to current date
es: Opción [FECHA_DE_AGENDADO] no debe ser previa a la fecha actual

source: Option [SCHEDULE_DATE] must not surpass year 2100
es: Opción [FECHA_DE_AGENDADO] no debe superar el año 2100

source: Option [SCHEDULE_DATE] must be in date format yyyy-mm-ddThh:mm
es: Opción [FECHA_DE_AGENDADO] debe estar en formato fecha yyyy-mm-ddThh:mm

source: Option [AGGRESSIVE_LEVEL] must be between 0-3
es: Opción [NIVEL_DE_AGRESIVIDAD] debe ser entre 0-3

source: Option [MAX_PORTS] must be a value between 0-65535
es: Opción [MÁXIMA_CANTIDAD_DE_PUERTOS] debe ser un valor entre 0-65535

source: Option [CUSTOM_PORTS] must be an array of values between 0-65535
es: Opción [PUERTOS_PERSONALIZADOS] debe ser una arreglo con valores entre 0-65535

source: Options [DOMAINS] or Options [NETWORKS] must not be empty
es: Opción [DOMINIOS] u Opción [REDES] no debe estar vacía

source: Option [NETWORKS] must be a valid network CIDR
es: Opción [REDES] debe ser un CIDR válido

source: Option [NETWORKS] is not allowed
es: Opción [REDES] no está permitida

source: Option [EXCLUDED NETWORKS] must be a valid network CIDR
es: Opción [REDES_EXCLUIDAS] debe ser un CIDR válido

source: Option [DOMAINS] must contain valid domains (and they must be resolveable!)
es: Opción [DOMINIOS] debe contener dominios válidos (y deber ser resolubles!)

source: Option [NET_INTERFACE] must be valid
es: Opción [INTERFAZ_DE_RED] debe ser válida

source: Option [ATTACK_THREADS] must be between 1-100
es: Opción [HILOS_DE_ATAQUE] debe ser entre 1-100

source: Option [SCAN_THREADS] must be between 1-100
es: Opción [HILOS_DE_ESCANEO] debe ser entre 1-100

source: One or more options are missing: %(err)s
es: Una o más opciones están faltando: %(err)s

source: There is already a scan in progress!
es: Ya hay un escaneo en progreso!

source: Registered a new scan successfully!
es: Nuevo escaneo registrado exitosamente!

source: Potential
es: Potencial

source: Undefined
es: Indefinido

source: Critical
es: Crítico

source: High
es: Alto

source: Medium
es: Medio

source: Low
es: Bajo

source: Informational
es: Informacional

source: Alert
es: Alerta

source: Details
es: Detalles

source: Result
es: Resultados

source: Mitigation
es: Mitigación

source: Resolve
es: Resolver

source: Assessment
es: Evaluación

source: Targets
es: Objetivos

source: Configuration
es: Configuración

source: Dictionary
es: Diccionario

source: Schedule
es: Agendar

source: Post Event
es: Acciones Posteriores

source: Assessment Title
es: Título Evaluación

source: Required
es: Requerido

source: Assessment Description
es: Descripción Evaluación

source: Name of Engineer
es: Nombre del Ingeniero

source: Specify either Networks, Domains, or both.
es: Specifique Red, Dominio o ambos.

source: Networks
es: Redes

source: Domains
es: Dominios

source: Exclusion
es: Exclusión

source: Excluded Networks
es: Redes Excluidas

source: Assessment Configuration
es: Configuración Evaluación

source: Aggressiveness Level
es: Nivel de Agresividad

source: Extremely Aggressive (Default)
es: Extremadamente Agresivo (Predeterminado)

source: Aggressive
es: Agresivo

source: Mildly Aggressive
es: Moderadamente Agresivo

source: Gentle
es: Gentíl

source: Allow Outbound Internet Connections
es: Pemitir Conexciones Salientes de Internet

source: Attempt Brute Force Attacks
es: Intentar Ataques de Fuerza Bruta

source: Attempt Denial of Service Attacks
es: Intentar Ataques de Denegación de Servicio

source: Port Scanning Options
es: Opciones de Escaneos de Puerto

source: Uses default if not specified
es: Utiliza predeterminado en caso que no se especifique

source: Maximum Ports
es: Cantidad Máxima de Puertos

source: All Ports (EXTREMELY slow.)
es: Todos los Puertos (EXTREMADAMENTE lento.)

source: 1000 = one thousand most commonly used ports
es: 1000 = mil puertos más comúnes

source: Custom Ports
es: Puertos Personalizados

source: Comma separated integers. Takes presedence over
es: Enteros separados por coma. Toma prioridad sobre

source: MAX_PORTS
es: Cantidad máxima de puertos

source: Parallel Scan
es: Escaneo en Paralelo

source: Parallel Attack
es: Ataque en Paralelo

source: Add your preferred word lists to be used in Brute Force attacks.
es: Agregue su lista de palabras de preferencia para ser usada en ataques de Fuerza Bruta.

source: Note:
es: Nota:

source: If no dictionary is specified, a built in dictionary will be used.
es: Si no se incluye un diccionario se ocupará uno predeterminado.

source: Brute Force
es: Fuerza Bruta

source: Usernames
es: Usuarios

source: Paste your list here
es: Pegue su lista aquí.

source: Separate the usernames with a new line.
es: Separe los usuarios con un salto de línea.

source: Passwords
es: Contraseñas

source: Separate the passwords with a new line.
es: Separe las contraseñas con un salto de línea.

source: Assessment Schedule
es: Agendado Evaluación

source: Run Once
es: Ejecutar Una Vez

source: Run Continuously
es: Ejecutar Continuamente

source: Schedule Run
es: Agendar Ejecución

source: * Running continuously will not stop until you reset the system
es: * La ejecución continua no se detendrá hasta resetear el sistema.

source: Schedule date and time
es: Fecha y hora de agendado

source: Calls back at the end of the assessment with relevant data (JSON POST)
es: Llama de vuelta al finalizar la evaluación con los datos relevantes (JSON POST)

source: Run Assessment
es: Ejecutar Evaluación

source: Schedule date must not be prior to current time.
es: Fecha de agendado no debe ser previa a la fecha y hora actual.

source: Schedule date must not surpass year 2100.
es: Fecha de agendado no debe superar el año 2100

source: Schedule date not in correct format.
es: Fecha de agendado no se encuentra en el formato correcto

source: Schedule date must be selected.
es: Fecha de agendado debe ser seleccionada

source: Assessment title must be set.
es: Título de la evaluación debe ser completado

source: Assessment title must not exceed 30 characters
es: Título de la evaluación no debe exceder los 30 caracteres

source: Assessment description must not exceed 200 characters.
es: Descripción de la evaluación no debe superar los 200 carateres

source: Engineer name must not exceed 20 characters.
es: Nombre del ingeniero no debe superar los 20 caracteres

source: Networks or Domains must be defined.
es: Redes o Dominios deben ser definidos.

source: Assets
es: Sistemas

source: IP Address
es: Dirección IP

source: Domain
es: Dominio

source: Ports
es: Puertos

source: Services
es: Servicios

source: Operating System
es: Sistema Operativo

source: Console
es: Consola

source: Console Output
es: Salida Consola

source: This console will start populating once data comes in...
es: Esta consola empezará a popular datos una vez que estos se obtengan...

source: File is streaming...
es: Archivo está stremeando...

source: Download
es: Descargar

source: Hosts Discovered
es: Host Descubiertos

source: Since Last Assessment
es: Desde Última Evaluación

source: Scans Executed
es: Escaneos Ejecutados

source: Since Last System Reset
es: Desde Último Reseteo del Sistema

source: Last Scanned
es: Último Escaneo

source: Confirmed Vulns
es: Vulns Confirmadas

source: Potential Vulns
es: Vulns Potenciales

source: Vulnerability Distribution
es: Distribución de Vulnerabilidades

source: Port Distribution
es: Distribuación de Puertos

source: Networks Scanned
es: Redes Escaneadas

source: Your last assessment included these networks
es: Última evaluación incluye estas redes

source: Domains Scanned
es: Dominios Escaneados

source: Your last assessment included these domains
es: Última evaluación incluye estos dominios

source: Live Hosts
es: Hosts Activos

source: These hosts were identified to be alive
es: Estos hosts fueron identificados como activos

source: IP Addresses
es: Direcciones IP

source: Graphical User Interface
es: Interfaz Gráfica de Usuarios

source: Usage
es: Uso

source: Table of Contents
es: Tabla de Contenidos

source: 1. Quickstart
es: 1. Inicio Rápido

source: 2. Assessment
es: 2. Evaluación

source: 3. Reports
es: 3. Reportes

source: 4. Notifications
es: 4. Notificaciones

source: 5. Security
es: 5. Seguridad

source: 7. Miscellaneous
es: 4. Misceláneo

source: Quickstart
es: Inicio Rápido

source: Quickstart is the best way to try out NERVE in its most simplest form. Think of it as running a basic scan, without the ability to define how it will execute.
es: Inicio Rápido es la mejor manera de probar NERVE en su forma más simple. Es similar a correr un escaneo básico sin la necesidad de especificar como ejecutarlo.

source: By using this option, you are required to specify
es: Al utilizar esta opción es requerido definir

source: Network CIDR notations
es: la notación CIDR de la red

source: does not support DNS.
es: no soporta DNS.

source: For example, if you want to scan your home network, you could simply type
es: Por ejemplo, en el caso de querer escanear su propia red loca, basta con ingresar

source: Of course, the IP will depend on your router IP scope.
es: Donde la dirección IP depende del alcance del router.

source: The settings of the scan if you choose to use Quickstart are as follows:
es: La configuración de los escaneos bajo la opción de Inicio Rápido es la siguiente:

source: Exclusions:
es: Exclusiones:

source: None
es: Ninguna

source: Aggressive level:
es: Nivel de agresividad:

source: Maximum
es: Máximo

source: Denial of Service:
es: Denegación de Servicio:

source: Disabled
es: Desabilitado

source: Brute Force:
es: Fuerza Bruta:

source: Outbound Internet Connections:
es: Conexiones Salientes de Internet:

source: Enabled
es: Habilitado

source: Interface:
es: Interfaz:

source: Max Ports:
es: Máxima Cantidad de Puertos:

source: Parallel Scan:
es: Escaneo en Paralelo:

source: Parallel Attack:
es: Ataque en Paralelo:

source: Post Event:
es: Acciones Posteriores:

source: Frequency:
es: Frecuencia:

source: Once
es: Una vez

source: Schedule Date:
es: Fecha de Agendado:

source: Assessment is where you configure your first advanced scan.
es: Evaluación es donde se configura un escaneo más avanzado.

source: You start by defining some metadata about your scan.
es: Se parte definiendo metadata del escaneo.

source: This is the name of the assessment. This name appears in the reports you generate in the GUI, such as the HTML. It will also show up in the API output when you call
es: Corresponde al nombre de la evaluación. Este aparece en los reportes generados , como HMTL. Este también aparecerá en el output de la API al llamar a

source: This is the description of the assessment. It's a free text description of what this assessment is about. Similiarly to the
es: Corresponde a la descripción de la evaluación. Es una descripción libre sobre lo que trata la evaluación. Similar al

source: it will show up in the API output when you call
es: también se muestra en el output de la API al llamar a

source: This is a field to describe who is running the assessment. Similiarly to the
es: Este campo se utiliza para describir la persona encargada de correr la evaluación. Similar al

source: it will show up in the reports, and also in the API output when you call
es: se muestra en los reportes y también en el output de la API al llamar a

source: Targets are the endpoints that will be scanned and assessed. These can be IP addresses, Domains and Subdomains.
es: Los objetivos corresponden a los endpoints que serán escaneados y analizados. Estos puede ser direcciones IP, Dominios o Subdominios.

source: NERVE doesn't do DNS discovery for a given parent domain. There are tools you could potentially use in conjuction with NERVE that will do this work for you. Such as Passive DNS, RiskIQ, Fierce, OWASP Amass, etc.
es: NERVE no realiza descubrimiento DNS para un dominio principal determinado. Existen herramienta que potencialmente podrían utilizarse en conjunto con NERVE para lograr esto. Algunas de estas son Passive DNS, RiskIQ, Fierce, OWASP Amass, etc.

source: This field takes a list of CIDR Networks (Comma separated). Example:
es: Este campo utiliza una lista de redes CIDR (separadas por coma). Por ejemplo:

source: Note: Any networks defined here will be excluded from the assessment.
es: Nota: Cualquier red definido aquí sera excluída de la evaluación.

source: This field takes a list of DNS records (Comma separated). Example:
es: Este campo toma una lista de registros DNS (separados por coma). Por ejemplo:

source: example.com, sub.example.com
es: ejemplo.com, sub.ejemplo.com

source: This is where the advanced configuration of the scan is defined.
es: Aquí es donde se define la configuración avanzada del escaneo.

source: This is going to ultimately decide which rules (checking if SSH is open is an example of a rule) run against your target scope. The more aggressive it is, the more rules are going to run.
es: Este campo decide que reglas (un ejemplo de regla es chequear que SSH este abierto) se efectúan sobre los objetivos durante un escaneo.

source: For example, a rule that makes a lot of HTTP GET requests will be run only if you choose the use the aggressive mode. A rule that checks if a port is open, would run under all conditions.
es: Por ejemplo, una regla que efectúa varias solicitudes HTTP GET solo se ejecuta en el nivel de agresividad más agresivo. Por otro lado, una regla que chequea si un puerto está abierto se ejecuta bajo cualquier condición.

source: Allow Outbound Connections
es: Permitir Conexiones Salientes

source: Some rules require making outbound internet connections, such as checking against CVE lists, etc.
es: Algunas reglas requieren conexiones salientes a internet para chequear, por ejemplo, contra listas de CVEs.

source: If you run NERVE internally in a dark network without internet, you could simply toggle this off.
es: En el caso de correr internamente NERVE en una red sin internet, esta opción simplemente se puede desactivar.

source: Some rules can run brute force attacks against a given server. For example, if a server is determined to have an SSH port open and it also accepts passwords as a mean of authentication, NERVE can attempt to run through a list of passwords and try to authenticate.
es: Algunas reglas pueden correr ataques de fuerza bruta contra ciertos servidores. Por ejemplo, si un servidor posee un puerto SSH abierto y también acepta contraseñas como medio de autenticación, entonces NERVE puede intentar autenticarse utilizando una lista de usuarios y contraseñas.

source: Note that if you provide a list of usernames and passwords via the
es: Es preciso señalar que si se provee una lista de usuarios y contraseñas vía la

source: Dictionary option
es: Opción de Diccionario

source: , it may take a long time for a full assessment to complete. Use with caution.
es: , puede que la herramienta demore bastante en completar la evaluación completa. Utilice con precaución.

source: Some rules can run test for Denial of Service vulnerabilities against a given server. Disable if you want to ensure your services are not bombarded.
es: Algunas reglas pueden correr pruebas de Denegación de Servicios contra servidores vulnerables. Es importante desabilitar esta opción para no afectar los servicios atacados.

source: Defining the Ethernet to use for port scanning. This is optional, if nothing is specified, it will use the default.
es: Permite definir la Ethernet utilizada para escanear los puertos. Esta es opcional, si no se especifíca se utilizará el valor por defecto.

source: This is a relatively important option. NERVE starts the assessment by executing a port scan. The more ports you scan for, the less likely you will miss things.
es: Esta opción es relativamente importante. NERVE empieza su evaluación ejecutando un escaneo de puertos. Mientras más puertos se escaneen, menos probable es omitir cosas.

source: However, scanning for many ports has a cost (time), thus, we typically recommend scanning for the top 1000-4000 ports. Find the balance that works for you. Too little ports means you may miss out on services, but the scan is going to be faster. Too many means you may sacrifice speed.
es: Sin embargo, escanear muchos puertos tiene un costo asociado (tiempo), por lo tanto, se recomienda escanear solo los principales 1000-4000 puertos. Es importante encontrar el balance que funciona para cada usuario. Muy pocos puertos puede resultar en omitir varios servicios, pero el escaneo será más rápido. En tanto, muchos puertos puede significar un gran sacrificio de velocidad.

source: The default value for maximum ports is
es: El valor por defecto para la máxima cantidad de puertos es

source: ports (this ensures that at least http/https/ftp/ssh are covered).
es: puertos (esto asegura que al menos http/https/ftp/ssh sea cubierto).

source: You could specify your own custom list of ports. NERVE starts the assessment by executing a port scan. The more ports you scan for, the less likely you will miss things.
es: También se puede especificar una lista personal de puertos. NERVE empieza la evaluación ejecutando un escaneo de puertos. Mientras más puertos se escaneen, menos probable es omitir cosas.

source: By default, if you do not specify a Custom Port list, NERVE will use the Maximum Ports value of
es: En el caso de no especificar una lista personalizada de puertos, se utilizará por defecto una Máxima Cantidad de Puertos de

source: If you specify
es: Al especificar

source: both
es: ambos

source: Maximum Ports and Custom Ports,
es: Máxima Cantidad de Puertos y Puertos Personalizados,

source: Custom Ports will take presedence
es: Puertos Personalizados tomará prioridad

source: and Maximum Ports will simply be ignored.
es: y Máxima Cantidad de Puertos simplemente será ingnorada.

source: This value represents the number of hosts which will be scanned simultaneously, for example, 60 means the port scan will run against 60 hosts at the same time.
es: Este valor representa la cantidad de máquina que serán escaneadas simultáneamente, por ejemplo, 60 significa que el escaneo de puertos correrá contra 60 máquinas al mismo tiempo.

source: The default value for Parallel Scan is
es: El valor por defecto de los Escaneos en paralelo es

source: This value represents the number of hosts which will be attacked simultaneously, for example, 60 means the attack rules will run against 60 hosts at the same time.
es: Este valor representa la cantidad de máquina que serán atacadas simúltaneamente, por ejemplo, 60 significa que el ataque de las reglas se efectuará en 60 máquinas al mismo tiempo.

source: The default value for Parallel Attack is
es: El valor por defecto de los Ataques en Paralelo es

source: Dictionary allows you to bring your own usernames and credentials list.
es: El diccionario permite ingresar una propia lista de usuarios y credenciales.

source: When the
es: Cuando la opción

source: Attempt Brute Force
es: Intentar Fuerza Bruta

source: option is enabled, we will take your list and run it against any brute-forceable services we identify.
es: se encuentra habilitada, se utilizará la lista ingresada contra cualquier servicio identificado que permita ataques de fuerza bruta.

source: If you do not provide a list of usernames and passwords, we will simply use our (very short) list of usernames and passwords.
es: En el caso que no se provea una lista de usuarios y contraseñas, simplemente se utilizará una lista propia (bien corta) de usuarios y contraseñas.
